tutorials/fluidSolidInteraction/beamInCrossFlow/elastoPlasticBeam/constant/solid/plasticStrainVsYieldStress
(
    ( 0    500 )
)